test/load-tests/matching.yml
 # BSD 3-Clause License
 # Copyright (c) 2017, Jembi Health Systems NPC
 # All rights reserved.

 # Redistribution and use in source and binary forms, with or without
 # modification, are permitted provided that the following conditions are met:

 # * Redistributions of source code must retain the above copyright notice, this
 #   list of conditions and the following disclaimer.

 # * Redistributions in binary form must reproduce the above copyright notice,
 #   this list of conditions and the following disclaimer in the documentation
 #   and/or other materials provided with the distribution.

 # * Neither the name of the copyright holder nor the names of its
 #   contributors may be used to endorse or promote products derived from
 #   this software without specific prior written permission.

 # THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 # AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 # IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 # DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 # FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 # DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 # SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 # CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 # OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 # OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 
config:
  target: 'http://localhost:3447'
  phases:
    - duration: 30
      arrivalRate: 1
      rampTo: 3
      name: 'Warm up'
    - duration: 60
      arrivalRate: 3
      name: 'Low load'
    # - duration: 60
    #   arrivalRate: 10
    #   name: 'Medium load'
    # - duration: 60
    #   arrivalRate: 20
    #   name: 'High load'
  processor: './load-test-utils.js'

scenarios:
  - name: 'Patient matching query'
    flow:
    - post:
        url: '/fhir/Patient/$match'
        beforeRequest: 'setAuthHeaders'
        json:
          resourceType: Parameters
          parameter:
          - name: resource
            resource:
              resourceType: Patient
              name:
              - family:
                - Matinyana
                given:
                - Charlton
              gender: male
              birthDate: '1972-02-10'
          - name: count
            valueInteger: 100
          - name: onlyCertainMatches
            valueBoolean: false